من  أحداث الاستيراد telethon  

من  jmub  استيراد  jmub

# ها ولك جاي تخمط خرب عقلك اي والله 😂🏃

jmthonself  =  خطأ


@ jmub . ar_cmd ( النمط = "تفعيل الذاتية" )
غير متزامن  def  start_datea ( حدث ):
     jmthonself العالمية
    jmthonself  =  صحيح
    في انتظار  edit_or_reply ( حدث " - تم بنجاح تفعيل حفظ الميديا ​​الذاتية من الان" )


@ jmub . ar_cmd ( نمط = "تعطيل الذاتية" )
غير متزامن  def  stop_datea ( حدث ):
     jmthonself العالمية
    jmthonself  =  خطأ
    في انتظار  edit_or_reply ( حدث " - تم بنجاح تعطيل حفظ الميديا ​​الذاتية من الان" )


@ jmub . على (
    الأحداث . NewMessage (
        func = لامدا  هـ : هـ . خاص  و ( صورة أو فيديو إلكتروني ) و e . _  _ _ الوسائط غير مقروءة  
    )
)
غير متزامن  def  tf3el ( حدث ):
     jmthonself العالمية
    إذا  جمعت نفسه :
        النتيجة  =  انتظار  الحدث . download_media ()
        انتظر  جمب . send_file ( "me" ، نتيجة ، تسمية توضيحية = "- تم بنجاح الحفظ بواسطة @ VV744" )
